COLORS = (
    # ЦВЕТ
    ("black", "Черный"),
    ("white", "Белый"),
    ("blue", "Синий"),
    ("red", "Красный"),
    ("gray", "Серый"),
    ("yellow", "Желтый"),
    ("green", "Зеленый"),
    ("silver", "Серебристый"),
)

TRANSMISSION = (
    # ТРАНСМИССИЯ
    ("auto", "Автомат"),
    ("mech", "Механическая"),
    ("robot", "Роботизированная"),
    ("vari", "Вариатор"),
)

DRIVE = (
    # ПРИВОД
    ("front", "Передний"),
    ("back", "Задний"),
    ("all", "Полный"),
)
STATE = (
    # СТАТУС
    ("new", "Новый"),
    ("used", "Б/У"),
)

BODY = (
    # ТИП АВТО
    ("sedan", "Седан"),
    ("hatchback", "Хэтчбэк"),
    ("crossover", "Кроссовер"),
    ("pickup", "Пикап"),
    ("van", "Ван"),
    ("minivan", "Минивэн"),
    ("cabriolet", "Кабриолет"),
    ("coupe", "Купе"),
)

SUBJECT = (
    # ТЕМА СООБЩЕНИЯ
    ("question", "Вопрос"),
    ("offer", "Предложение"),
    ("complaint", "Жалоба"),
)
